---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures
source: html/8b9bfa39-1c9b-5cb0-14f1-0f49e2f8828a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures

Failures about EnergyAnalysis.

## Syntax (C#)
```csharp
public static class EnergyAnalysisFailures
```